0xsmirk/mcu_cmsis_svd/Holtek/ht32f275x.svd
      </registers>
    </peripheral>
    <!--AFIO-->
    <peripheral>
      <name>AFIO</name>
      <version>1.0</version>
      <description>AFIO</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40022000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <registers>
        <!--AFIO_ESSR0-->
        <register>
          <name>AFIO_ESSR0</name>
          <displayName>AFIO_ESSR0</displayName>
          <description>AFIO_ESSR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EXTI0PIN</name>
              <description>EXTI0PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI1PIN</name>
              <description>EXTI1PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI2PIN</name>
              <description>EXTI2PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI3PIN</name>
              <description>EXTI3PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI4PIN</name>
              <description>EXTI4PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI5PIN</name>
              <description>EXTI5PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI6PIN</name>
              <description>EXTI6PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI7PIN</name>
              <description>EXTI7PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_ESSR1-->
        <register>
          <name>AFIO_ESSR1</name>
          <displayName>AFIO_ESSR1</displayName>
          <description>AFIO_ESSR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EXTI8PIN</name>
              <description>EXTI8PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI9PIN</name>
              <description>EXTI9PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI10PIN</name>
              <description>EXTI10PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI11PIN</name>
              <description>EXTI11PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI12PIN</name>
              <description>EXTI12PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI13PIN</name>
              <description>EXTI13PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI14PIN</name>
              <description>EXTI14PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI15PIN</name>
              <description>EXTI15PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPACFGR-->
        <register>
          <name>AFIO_GPACFGR</name>
          <displayName>AFIO_GPACFGR</displayName>
          <description>AFIO_GPACFGR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PACFG0</name>
              <description>PACFG0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG1</name>
              <description>PACFG1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG2</name>
              <description>PACFG2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG3</name>
              <description>PACFG3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG4</name>
              <description>PACFG4</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG5</name>
              <description>PACFG5</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG6</name>
              <description>PACFG6</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG7</name>
              <description>PACFG7</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG8</name>
              <description>PACFG8</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG9</name>
              <description>PACFG9</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG10</name>
              <description>PACFG10</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG11</name>
              <description>PACFG11</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG12</name>
              <description>PACFG12</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG13</name>
              <description>PACFG13</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG14</name>
              <description>PACFG14</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG15</name>
              <description>PACFG15</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
