0xsmirk/mcu_cmsis_svd/Holtek/ht32f275x.svd
        <!--GPTM1_CH0CCR-->
        <register>
          <name>GPTM1_CH0CCR</name>
          <displayName>GPTM1_CH0CCR</displayName>
          <description>GPTM1_CH0CCR</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH0CCV</name>
              <description>CH0CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH1CCR-->
        <register>
          <name>GPTM1_CH1CCR</name>
          <displayName>GPTM1_CH1CCR</displayName>
          <description>GPTM1_CH1CCR</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH1CCV</name>
              <description>CH1CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH2CCR-->
        <register>
          <name>GPTM1_CH2CCR</name>
          <displayName>GPTM1_CH2CCR</displayName>
          <description>GPTM1_CH2CCR</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH2CCV</name>
              <description>CH2CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM1_CH3CCR-->
        <register>
          <name>GPTM1_CH3CCR</name>
          <displayName>GPTM1_CH3CCR</displayName>
          <description>GPTM1_CH3CCR</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CH3CCV</name>
              <description>CH3CCV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--BFTM0-->
    <peripheral>
      <name>BFTM0</name>
      <version>1.0</version>
      <description>BFTM0</description>
      <groupName>BFTM</groupName>
      <baseAddress>0x40076000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>BFTM0</name>
        <value>57</value>
      </interrupt>
      <registers>
        <!--BFTM0_CR-->
        <register>
          <name>BFTM0_CR</name>
          <displayName>BFTM0_CR</displayName>
          <description>BFTM0_CR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIEN</name>
              <description>MIEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OSM</name>
              <description>OSM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CEN</name>
              <description>CEN</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_SR-->
        <register>
          <name>BFTM0_SR</name>
          <displayName>BFTM0_SR</displayName>
          <description>BFTM0_SR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MIF</name>
              <description>MIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RESERVED</name>
              <description>Reserved.</description>
              <bitRange>[31:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_CNTR-->
        <register>
          <name>BFTM0_CNTR</name>
          <displayName>BFTM0_CNTR</displayName>
          <description>BFTM0_CNTR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CNTR</name>
              <description>CNTR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--BFTM0_CMPR-->
        <register>
          <name>BFTM0_CMPR</name>
          <displayName>BFTM0_CMPR</displayName>
          <description>BFTM0_CMPR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
